#include <iostream>
//Задача за извеждане на числа в обратен ред с цикъл while/do while/.
using namespace std;
int main()
{
	long int k; //създаване на променлива к.
	cout << "k=";
	cin >> k;
	while (k != 0)//Докато к е различно от нула задачите в цикъла ще се повтарят.
	{
		cout << k % 10;//Тази част служи за извеждане на последното число като се дел на 10 с остатък и се взима остатъкът, който е последното число.
		k = k / 10;//Тази част служи за премахване на последното число понеже, когато инт се дели на 10 остатъкът не се записва.Пример(54321 делено на 10 ще е 5432 и така за всяко следващо делене докато к не стане равно на нула).
	}
}


#include <iostream>
using namespace std;
//Задача за намиране на най-голямото и най-малкото число използвайки while до въвеждане на 0;

int main()
{
	double max, min, number;//Създаване на 3 променлив, макс за максималната стойност, мин за минималната и нъмбър за въвеждане на числовите стойностите.
	cin >> number;
	min = number;//Задаване на предварителна стойност на макс и мин за да могат да се сравняват в цикъла.
	max = number;
	while (number != 0) //Докато не се въведете 0 цикълът ще продължи да се изпълнява.
	{
		if (max < number) // ако макс е по-малко от числото то ще заеме неговата стойност понеже числото ще е по-голямо от предишната максимална стойност.
		{
			max = number;
		}
		if (min > number)//ако мин е по-голямо от числото то ще заеме неговата стойност понеже числото ще е по-малко от предишната минимална стойност
		{
			min = number;
		}
		cin >> number;
	}
	cout << "Min=" << min << endl;
	cout << "Max=" << max << endl;
}



#include <iostream>
//Задача за въвеждане на число между 5 и 50 и умножаването му на себе си.
using namespace std;
int main()
{
	int n;
	cout << "n=";
	cin >> n;
	while ((n < 5) || (n > 50))// Ако числото не е между 5 и 50 ще трябва да се въведе друго число докато въведеното число не изпълни условието.
	{
		cout << "Wrong data! ";
		cout << "Enter n again!" << endl;
		cout << "n=";
		cin >> n;
	}
	cout << n * n << endl;
}


#include <iostream>
//Програма за извеждане на число в обратен ред използвайки for цикъл.
using namespace std;
int main()
{

	long int k; 
	cout << "k=";
	cin >> k;
	for (int i = 1; i <= 5;i++) //създаване на фор цикъл със зададен брой на повторенията на програмата.(в случая е i = 5 понеже трябва да се въведе петцифрено число)
	{
		cout << k % 10;//Тази част служи за извеждането на последното число като числото се дели на 10 и се взима няговия остатък.
		k = k / 10;// Тази част служи за отстраняването на остатъка за да може да се вземе следващото число.
	}
}


#include <iostream>
//Задача за въвеждане на число и извеждането на числата, които са по-малки от него и се делят на 5.
using namespace std;
int main()
{
	int n;
	cout << "n=";
	cin >> n;
	for (int i = 0; i < n; i++)// Докато i е по-малко от n програмата ще продължи да изпълнява условието във фор цикъла.
    {
		if (i % 5 == 0) //Тази част служи за да може само числата които се делят на 5 да се изведадат, 
        //докато фор цикъла гарантира,че числата няма да са по-големи от въведенот от нас число.
        //Например, ако въведем 50 програмата ще спре като стигне до 50 и няма да изведе число по-голямо от 50.
        {
			cout << i << endl;
		}
	}
}

#include<iostream>
//Да се състави програма, която въвежда от клавиатурата целите числа m и n (m<n). 
//Програмата да извежда всички числа в интервала [m, n], които са кратни на 5.

using namespace std;
int main()
{
   int m,n;
   cin>>m>>n;
   while (m>n)//Тази част макар и да не е добавена в предоставеното решение служи за да е вярно условието, 
   //че m трябва да е по-малка от n.В случай, че условието не е спазено потребителят ще бъде помолен да въведе стойностите отново.
   {
cin>>m>>n;
   }
   for(int i=m;i<=n;i++)// обикновен фор цикъл но вместо задаването на статични стойности тези се задават от потребителя.
   //Като местата където трябва да има числа са заместени със стойностите m и n.

      if(i%5==0) cout<<i<< ' ';//Това служи за извеждането на всички числа в интервала на фор цикъла делящи се на 5.
   return 0;
}

#include <iostream>
/*Да се напише програма, която въвежда от клавиатурата естествено число n и след него 
n на брой реални числа. Да се изведат максималното и минималното от тях.
*/
using namespace std;
int main()
{
	int n;//Създаваме стойност n, която ще служи за броят числа, които ще трябва да въведем.
	cin >> n;
	double max, min, number;//Създаване на 3 променлив, max за максималната стойност, min за минималната и 
    //number за въвеждане на числовите стойностите.
	cin >> number;
	min = number;//Задаване на предварителна стойност на max и min за да могат да се сравняват в цикъла.
	max = number;
	for (int i = 1; i < n; i++) //Тук трябва да се обърне внимание, че стойноста на i е 1 вместо 0. Това е понеже, ако потребителят 
    //въведе n = 5 ще трябва да се въведат 6 числа вместо исканите 5,затова или i трябва да е равно на 1, или (i < n - 1).тоест 
    //for(int i = 0;i < n - 1;i++)
    {
		cin >> number;
		if (number > max) // ако макс е по-малко от числото то ще заеме неговата стойност 
        //понеже числото ще е по-голямо от предишната максимална стойност.
        {
			max = number;
		}
		if (number < min)//ако мин е по-голямо от числото то ще заеме неговата стойност понеже числото ще е 
        //по-малко от предишната минимална стойност.
		{
        {
			min = number;
		}
	}
	cout << "Min=" << min << endl;
	cout << "Max=" << max << endl;
}

#include<iostream>
/*Да се състави програма, която въвежда от клавиатурата естествено число n и n на брой символи. 
Програмата да извежда броя на тези от въведените символи, които са малки латински букви.
*/
using namespace std;
int main()
{
   unsigned int n,br=0;/*съзадават се  2 променливи, n,което ще служи за задаване на лимита на въведените символи в 
   променливата char c и br която ще служи за преброяването на всички намерени малки латински букви.*/
   char c;//Тук ще се въвеждат символите(букви,цифри и така нататък)
   cin>>n;
   for(int i=0;i<n;i++)//Този фор цикъл служи за въвеждането на само толкова символи колкото предварително сме задали от стойноста n.
   {
    cin>>c;
    if(c>='a'&&c<='z') br++;//Ако е границата на малките латински букви br ще се увеличи с едно.Бележка: 
    //няма разлика дали символите ще бъдат въведени един по един или навъднъж
   }
   cout<<br<<endl;
   return 0;
}


//Масиви

// Масивът позволява складирането на повече от една стойност в дадена променлива. 

#include <iostream>
/*
Да се състави програма, която въвежда от клавиатурата стойностите на 10 елемента на масив, 
които са цели числа. *Допълнение: да се намери сумата на елементите в масива.
*/
using namespace std;
int main()
{
	int arr[10];//Създаване на масив от 10 символа.
	for (int i = 0; i < 10; i++) 
    {
		cin >> arr[i];
	}
	int sum = 0;
	for (int i = 0; i < 10; i++) 
    {
		sum += arr[i];
	}
	cout << "sum=" << sum;
}


#include <iostream>
/* Да се състави програма, която въвежда в масив средния годишен успех на всеки ученик от един клас.
 Да се изведе най-високия успех.*/
using namespace std;
int main()
{
	double arr[30];//Създаване на масив от тип дабъл, в който ще се въвеждат оценките.
	int n;//Създаване на променлива, която ще служи за залагане на границата на въведените оценки. 
	cout << "Enter number of students: ";
	cin >> n;
	for (int i = 0; i < n; i++) //Създава се for  цикъл, който ще служи за въвеждането на оценките една по една.
	{
		cin >> arr[i];//Въвеждането става по следния начин - каквато е стойноста на i на тази позиция в масива ще се въведе оценката.
		// Тоест при i = 0 ще се въведе първата оценка, при i = 1 
		//ще се въведе втората и така нататък докато не стигне до 30 където ще се въведе последната оценка.
	}
	double max = arr[0];//Създаваме на променлива от тип дабъл , в която ще се складира най-високата от всички въведени от нас оценки.
	//Тази променлива ще е равна на първата въведена от нас оценка за да може сравнението да започне.
	for (int i = 1; i < n; i++) //Типичен фор цикъл който върти от второто до последното число на нашия списък с оценки.
	//(Започва от втората понеже променливата макс е вече равна на първата оценка)
	{
		if (arr[i] > max) //С помощта на фор цикъла можем да вземем всяка една стойност от списъка с оценки и да я сравним с променливата макс.
		//В случай , че някоя от тези оценки/стойности е по-голяма от max, max ще вземе нейната стойност.
		{
			max = arr[i];
		}
	}
	cout << max;
}

#include <iostream>
/*Да се състави програма, която въвежда в масив средния годишен успех на всеки ученик от един клас.
 Да се провери съществува ли ученик с успех x, предварително зададен от клавиатурата.
*/
//Бележка: това е задачата дадена на упражнението, която по мое мнение е по-трудна отколкото трябва да е. 
//Отдолу съм написал и по-опростена версия на тази програма, която смятам, че ще е по-лесна да се разбере.
using namespace std;
int main()
{
	double arr[30], x;//Като цяло се създават 2 променливи от тип double, едната, която е и масив, 
	//в която ще се складират оценките и другата, в която ще се запише търсената от нас оценка.
	int i, n;// създава се инт променлива n която ще служи за граница на фор цикъла.
	cout << "Enter number of students: ";
	cin >> n;
	for (int i = 0; i < n; i++) //Този фор цикъл ще служи за въвеждането на оценките от потребителя докато не се достигне стойноста n.
	{
		cin >> arr[i];
	}
	cout << "x=";
	cin >> x;
	i = 0;//Тук  се променя стойноста на i да е 0 отново за да може да се да се проверят всичките оценки.
	while ((arr[i] != x) && (i < n))// Докато arr[i] не е равно на x (оценката която търсим) и i < n ще се отива на 
	//следващата оценка докато не се намери търсената от нас оценка или не се изредят всички оценки.
	 {
		i++;
	}
	if (arr[i] == x) //Ако се намери търсената от нас оценка се извежда съобщението отдолу.
	{
		cout << "Student with such grade found.";
	}
	else {
		cout << "Student with such grade not found.";
	}
}

#include <iostream>
/* Да се състави програма, която въвежда в масив средния годишен успех на всеки ученик от един клас. 
Да се провери съществува ли ученик с успех x, предварително зададен от клавиатурата.
*/
//Това е по-лесната версия.
using namespace std;
int main() 
{
   int n,br = 0;// Създават се 2 променливи от тип инт - n която ще обозначи размера на нашия масив и едновременно граница на нашия for цикъл 
   // и br, с който ще разберем дали търсената от нас оценка е налична.
   cin >> n;
   double grade [n], search;//Създават се 2 променливи от тип 
   //double - grade, в който ще се въведат всички оценки и search където ще се въведе търсената от нас оценка.
   cin >> search;
   for (int i = 0; i < n; i++)//Фор цикъл за въвеждането на оценките.
   {
       cin >> grade[i];
   }
   for (int i = 0; i < n; i++)//Фор цикъл за сравняване на оценките
   {
       if (grade[i] == search)// Тук всички оценки се изброяват от първата до последната и се сравняват с търсената от нас
	   //, и в случай, че има съответсвие br се увеличава с 1. Тоест, ако търсената от нас оценка не се съдържа нито един път br ще остане 0.
       {
          br++; 
       }
   }
   if (br > 0)//Забележка, този if цикъл (или там каквото е) е извън for циклите, за да се избегне извеждането на повече от едно потвърждение.
   //И така в случай, че br е повече от нула ще се изведе yes което означава че е имало поне едно съответствие с търсената от нас оценка.
   {
       cout << "yes";
   }
}


#include <iostream>
#include <cstring>
/*
Да се напише програма, която декларира ЧАР(тази година няма да използваме стрингове) до 20 символа, 
чете го от клавиатурата, след което го извежда символ по символ, 
всеки символ на нов ред.
*/
using namespace std;
int main()
{
        setlocale(LC_ALL, "");//Като цяло няма да се иска на тестове, но служи за позволяване на писане на езици различни от английския.
        char text[20];//Създава се чар с максимум от 20 символа. 
        cout << "Въведете текст: ";
        gets_s(text);//Като цяло мисля, че може да се използва и cin.
        for (int i = 0; i < strlen(text); i++)//създава се фор цикъл който взима броя на въведените от нас символи чрез strlen, 
		//(в противен случай ще се изведат едни звездички) и се извеждат всички символи поотделно на нов ред.
        {
                    cout << text[i] << endl;
        }
}

#include <iostream>
/*
Да се напише програма, която декларира стринг до 20 символа, чете го от клавиатурата, 
след което без да използва готова функция намира и извежда дължината му.
*/
using namespace std;
int main()
{
        setlocale(LC_ALL, "");
        char text[20];
        cout << "Въведете текст: ";
        gets_s(text);
        for (int i = 0; i < 20; i++)//
        {
            if (text[i] == 0)
            {
                        cout << i;
                break;
            }
        }
}
